app/controllers/api/v1/cart_controller.rb

SELECT "carts".* FROM "carts" ORDER BY created_at DESC
---
      def index
        #index of all items in the cart.  In later versions with would be amended to only show for checked in user
        cart = Cart.order('created_at DESC')

INSERT INTO "carts" ("userID", "title", "price", "weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["userID", 1], ["title", "Flash Point"], ["price", 25.0], ["weight", 5.0], ["created_at", "2019-07-20 08:39:19.093454"], ["updated_at", "2019-07-20 08:39:19.093454"]]
---
      def create
        userCart = Cart.new(item_params)
        if userCart.save

SELECT "carts".* FROM "carts" WHERE "carts"."userID" = $1  [["userID", 1]]
SELECT COUNT(*) FROM "carts" WHERE "carts"."userID" = $1  [["userID", 1]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]
---
      def remove_all
        userCart = Cart.where(userID: params[:id])
        if userCart.count > 1
          userCart.destroy_all

SELECT "carts".* FROM "carts" WHERE "carts"."userID" = $1  [["userID", 1]]
---
      def show
        #this shows a users cart rather than a specific Item.  this can be amended later if needed.
        userCart = Cart.where(userID: params[:id])

SELECT "carts".* FROM "carts" WHERE "carts"."userID" = $1  [["userID", 1]]
---
      def generate_delivery_from_cart
        #generates a json file with the perfect items in 1 delivery box, when considering weight and delivery date( smaller is better)
        cart = Cart.where(userID: params[:id])